#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Для внутреннего использования.
// 
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Проверка на наличие дублей по наименованию и виду номенклатуры.
	//max Пока не будем проверять на дубли
	//ДополнительныеПараметры = Новый Структура;
	//ДополнительныеПараметры.Вставить("Режим",  "КонтрольПоНаименованию");
	//ДополнительныеПараметры.Вставить("Ссылка", Ссылка);
	//
	//Дубли = ПоискИУдалениеДублей.НайтиДублиЭлемента("Справочник.Номенклатура", ЭтотОбъект, ДополнительныеПараметры);
	//Если Дубли.Количество() > 0 Тогда
	//	Ошибка = НСтр("ru = 'Номенклатура с таким наименованием и видом уже существует.'");
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Ошибка, , "Объект.Наименование", , Отказ);
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
