#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("МоментДокумента") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("МоментДокумента",Параметры.МоментДокумента);
	КонецЕсли;
	Если Параметры.Свойство("Контрагент") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Контрагент",Параметры.Контрагент);
		Контрагент = Параметры.Контрагент;
	КонецЕсли;
	Если Параметры.Свойство("СсылкаНаОбъект") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("СсылкаНаОбъект",Параметры.СсылкаНаОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОповеститьОВыборе(Элементы.Список.ТекущиеДанные.Абонемент);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьАбонемент(Команда)
	
	СтруктураНовогоДокумента = Новый Структура("Контрагент",Контрагент); 
	
	Адрес = ПоместитьВоВременноеХранилище(СтруктураНовогоДокумента);//ПолучитьАдресНовогоДокумента(ЭтаФорма.УникальныйИдентификатор);
	ПараметрыНовгоДокумента = Новый Структура("АдресХранилища", Адрес);
	ОткрытьФорму("Документ.ПродажаАбонемента.ФормаОбъекта", ПараметрыНовгоДокумента, ЭтаФорма,,ВариантОткрытияОкна.ОтдельноеОкно,,Новый ОписаниеОповещения("СозданиеАбонементаПослеСозданияНаСервере",ЭтотОбъект, Новый Структура),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Процедура СозданиеАбонементаПослеСозданияНаСервере(ЗначениеВыбора, ДополнительныеПараметры) Экспорт
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	ОповеститьОВыборе(Элементы.Список.ТекущиеДанные.Абонемент);
КонецПроцедуры

#КонецОбласти
